#include "ui/tui.hpp"
#include <ncurses.h>

void start_ui() {
    initscr();
    noecho();
    curs_set(0);
}

void update_ui(long long attempts) {
    clear();

    // 🔥 ASCII Banner
    mvprintw(1, 2, "   █████╗ ██╗      ██████╗██╗  ██╗███████╗███╗   ███╗██╗   ██╗");
    mvprintw(2, 2, "  ██╔══██╗██║     ██╔════╝██║ ██╔╝██╔════╝████╗ ████║╚██╗ ██╔╝");
    mvprintw(3, 2, "  ███████║██║     ██║     █████╔╝ █████╗  ██╔████╔██║ ╚████╔╝ ");
    mvprintw(4, 2, "  ██╔══██║██║     ██║     ██╔═██╗ ██╔══╝  ██║╚██╔╝██║  ╚██╔╝  ");
    mvprintw(5, 2, "  ██║  ██║███████╗╚██████╗██║  ██╗███████╗██║ ╚═╝ ██║   ██║   ");
    mvprintw(6, 2, "  ╚═╝  ╚═╝╚══════╝ ╚═════╝╚═╝  ╚═╝╚══════╝╚═╝     ╚═╝   ╚═╝   ");

    // Separator
    mvprintw(8, 2, "-------------------------------------------------------------");

    // Stats
    mvprintw(10, 4, "[+] Attempts        : %lld", attempts);
    mvprintw(11, 4, "[+] Engine Status   : RUNNING");
    mvprintw(12, 4, "[+] Mode            : OFFLINE CRACK");

    mvprintw(14, 2, "Press Ctrl+C to stop...");

    refresh();
}

void stop_ui() {
    endwin();
}
